# MepWaterloopType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepWaterloopType Property
ParameterTypeId Class See Also
---
"Loop Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepWaterloopType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepWaterloopType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepWaterloopType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace